# -------------------------------------------------------------------------------------------
class urllib_request(): # модуль который может скачивать из интернета,читать и парсить сайты
    import urllib.request

    urllib.request.urlretrieve(url, nameFile), """urlretrieve скачивает файл из интернета давая имя nameFile"""

# -------------------------------------------------------------------------------------------
"""
Вот команды, которые нам понадобятся в гите:
git clone ссылка путь_куда_клонировать
git pull (получает обновления с хаба)
git log (чекнуть чё было пока я отошёл)
git status (проверяет изменения на локалке)
git branch (просмотр всех веток)
git checkout feauture (переключение ветки)
git add . (фиксирование изменений)
git commit -m "task #11 change_file_HZ_NAHUYA" (сделать коммит)
git push -u origin feauture (отправить коммит в свою ветку на хабе)"""
# -------------------------------------------------------------------------------------------











