"""
Сумма квадратов первых десяти натуральных чисел равна
            1^2 + 2^2 + ... + 10^2 = 385

Квадрат суммы первых десяти натуральных чисел равен
            (1 + 2 + ... + 10)^2 = 552 = 3025

Следовательно, разность между суммой квадратов и квадратом суммы
 первых десяти натуральных чисел составляет 3025 − 385 = 2640.

Найдите разность между суммой квадратов и квадратом суммы первых n натуральных чисел.


  №    Время  Замедление       Число                     Результат
---  -------  ------------  --------  ----------------------------
  1  6e-06    0.001%           10000              2500166641665000
  2  1.8e-06  0.00%           100000          25000166664166649856
  3  1.8e-06  0.00%          1000000      250000166666416672473088
  4  1.1e-06  0.00%         10000000  2500000166666641498542440448
"""


def solution(n):
    """ Возвращает разницу между суммой квадратов и квадратом суммы первых N натуральные чисел.

    s  = N(N + 1) / 2
    s2 = N(N + 1)(2N + 1) / 6
    s^2 - s2 = (N^4 / 4) + (N^3 / 6) - (N^2 / 4) - (N / 6)

    >>> solution(10)
    2640
    >>> solution(15)
    13160
    >>> solution(20)
    41230
    >>> solution(50)
    1582700
    """
    sum_of_squares = n * (n + 1) * (2 * n + 1) / 6
    square_of_sum = (n * (n + 1) / 2) ** 2
    return int(square_of_sum - sum_of_squares)


optimized_solution = lambda n: int((n ** 4 / 4) + (n ** 3 / 6) - (n ** 2 / 4) - (n / 6))

if __name__ == "__main__":
    # print(solution(int(input().strip())))
    ### Run Time-Profile Table ###
    import sys;sys.path.append('..')
    from time_profile import TimeProfile
    TimeProfile(optimized_solution, [10_000, 100_000, 1_000_000, 10_000_000])
