"""
Сумма квадратов первых десяти натуральных чисел равна
            1^2 + 2^2 + ... + 10^2 = 385

Квадрат суммы первых десяти натуральных чисел равен
            (1 + 2 + ... + 10)^2 = 552 = 3025

Следовательно, разность между суммой квадратов и квадратом суммы
 первых десяти натуральных чисел составляет 3025 − 385 = 2640.

Найдите разность между суммой квадратов и квадратом суммы первых n натуральных чисел.


  №      Время  Замедление       Число                     Результат
---  ---------  ------------  --------  ----------------------------
  1  0.0027122  0.271%           10000              2500166641665000
  2  0.0249964  2.23%           100000          25000166664166650000
  3  0.244371   21.94%         1000000      250000166666416666500000
  4  2.3986     215.42%       10000000  2500000166666641666665000000
"""


def solution(n):
    """ Возвращает разницу между суммой квадратов и квадратом суммы первых N натуральные чисел.

    >>> solution(10)
    2640
    >>> solution(15)
    13160
    >>> solution(20)
    41230
    >>> solution(50)
    1582700
    """
    sum_of_squares = 0
    square_of_sum = 0
    for i in range(1, n + 1):
        sum_of_squares += i ** 2
        square_of_sum += i
    result_number = square_of_sum ** 2 - sum_of_squares
    return result_number


if __name__ == "__main__":
    print(solution(int(input().strip())))
    # ### Run Time-Profile Table ###
    # import sys;sys.path.append('..')
    # from time_profile import my_time_this
    # my_time_this(solution, [10_000, 100_000, 1_000_000, 10_000_000])