"""
Сумма 1^1 + 2^2 + 3^3 + ... + 10^10 = 10405071317.

Найдите последние десять цифр суммы 1^1 + 2^2 + 3^3 + ... + 1000^1000.

  №      Время  Замедление      Аргумент    Результат
---  ---------  ------------  ----------  -----------
  1  0.0081473  0.815%              1000   9110846700 (ответ)
  2  4.50355    449.540%           10000   6237204500
"""


def solution1(n=1000):
    """Находит последние десять цифр суммы 1^1 + 2^2 + 3^3 + ... + n^n.
    """
    return sum(i ** i for i in range(1, n + 1)) % (10 ** 10)


if __name__ == '__main__':
    ### Run Time-Profile Table ###
    import sys; sys.path.append('..')
    from time_profile import TimeProfile
    TimeProfile(solution, [1000, 10000])